# 1) Часы и минуты в секунды: Напишите функцию, которая принимает целочисленные 
# значения часов и минут, конвертирует эти значения в секунды, а затем суммирует 
# их и возвращает в качестве результата.

# def clock(min,sec):
#     res = min * 60 
#     sum = res + sec 
#     return sum 
# print(clock((int(input('Введите мин:'))),(int(input('Введите сек:')))))



# 2) Возраст в дни: Напишите функцию, которая принимает возраст (количество лет) и 
# преобразует это значение в количество дней.

# def days(age):
#     res = age * 365
#     return res 
# print(days(int(input('Введите возраст:'))))


# 3) Сколько ног на ферме: Для решения этой задачи необходимо написать функцию, 
# которая посчитает количество ног у всех животных на ферме. На ферме живут курочки, 
# коровки, и свинки. Зная количество животных каждого вида, посчитайте, сколько всего 
# ног у всех животных на ферме.
# def legs(animal,q):
    
#     if animal == 'курочка':
#         res = q * 2 
#         return res
#         print(f'колво ног: {res}')
#     elif animal == 'коровка':
#         res2 = q * 4
#         return res2
#         print(f'колво ног: {res2}')
#     elif animal == 'свинка':
#         res3 = q * 4
#         return res3
#     return 0
    
# count = 0 
    
# while True: 
#     count += legs(animal:=input('Введите название животного(курочка,свинка или коровка):'),int(input('Введите колво:')))
#     print(count)
#     if animal == 'выход':
#         break 



        



