# 1) '''Напишите декоратор, который проверяет, что функция вызывается с 
# определенными типами аргументов.'''



# 2) '''Создайте декоратор, который автоматически преобразует результат 
# функции в другой тип данных,'''



# 3) '''Реализуйте декоратор, который ограничивает максимальное количество 
# вызовов функции.'''



# 4) '''Напишите декоратор, который автоматически логирует исключения, 
# возникающие внутри функции.'''



# 5) '''Создайте декоратор, который выполняет аутентификацию пользователя 
# перед вызовом функции.'''



# 6) '''Реализуйте декоратор, который изменяет значение возвращаемого результата функции, 
# например, умножая его на определенный коэффициент.'''



# 7) '''Напишите декоратор, который ограничивает доступ к функции только определенным 
# пользователям или ролям.'''



# 8) '''Создайте декоратор, который преобразует аргументы функции в определенный формат 
# перед её выполнением, например, в строку в верхнем регистре.'''



# 9) '''Напишите декоратор, который устанавливает максимальное время выполнения 
# функции и завершает её, если оно превышено.'''



# 10) '''Напишите декоратор, который ограничивает доступ к функции только в 
# определенное время суток.'''



# 11) Напишите декоратор, который перехватывает определенные исключения, возникающие в 
# функции, и преобразует их в другие исключения или обрабатывает особым образом.