# 1) Создайте переменную x и дайте ей любое числовое значение
# 1.1 Создайте переменную y и дайте ей любое числовое значение

x = 4
y = 3

# 1.2 Найдите сумму,произведение,вычитание чисел x,y  . Итоги запишите в другие переменные
sum = x + y 
sub = x - y 
prod = x * y 
div = x / y 
print(sum,sub,prod,div)


# 2) Создайте переменную name и выведите 'name' 5 раз(Используя print 1 раз)

a = 'name'
print(('\n'+ a)*5)

# 3) Создайте переменную phone, brand, year дайте им значения
# Вывод данных должен иметь такой вид:
phone = '15 Pro Max'
brand = 'apple'
year = 2023
print(f'Модель телефона {phone} компании {brand} {year} года ')
# Модель телефона "phone" компании "brand" "year" года

