# 1) Проверить введенное пользователем число и если оно больше 5 то вывести “True”, иначе “False”.

# chislo = int(input('vvedite chislo:'))
# if chislo > 5: 
#     print(True)
# else: 
#     print(False)

# _______________________________________________________________________________________________________
    
#2) Проверить введенные пользователем данные и если длина строки больше или равна 5 символам вывести “True” иначе “False”.
# chislo = input('vvedite:')
# if len(chislo)>=5: 
#     print(True)
# else: 
#     print(False)

# _________________________________________________________________________________________________________

# 3) Проверить введенное пользователем значение если оно больше или равно 90, вывести
# “Отлично ваша оценка 5”, если значение больше или равно 80, вывести “Здорово ваша оценка 4”, 
# если значение больше или равно 70, вывести “Хорошо ваша оценка 3”, если значение больше или равно 60, вывести 
# “Вам стоит подучить материал", в других случаях “вы не сдали экзамен”.

# otsenka = int(input('Введите ваш балл:'))
# if otsenka >=90:
#     print('Отлично ваша оценка 5')
# elif otsenka >= 80: 
#     print('Здорово ваша оценка 4')
# elif otsenka >= 70: 
#     print('Хорошо ваша оценка 3')
# elif otsenka >=60: 
#     print('Вам стоит подучить дополнительный материал')
# else:
#     print('вы не сдали экзамен')

# _______________________________________________________________________________________________________

# 4)Проверить введенное пользователем число если оно отрицательное то вывести “negative”, 
# если положительное то “positive”, если оно равно 0 то вывести “Zero”

# chislo = int(input('vvedite chislo:'))
# if chislo<0: 
#     print('negative')
# elif chislo == 0:
#     print('zero')
# else:
#     print('positive')

# _________________________________________________________________________________________________________________

# 5)Даны два целых числа. Выведите значение наименьшего из них.
# chislo1 = int(input('vvedite pervoe chislo:'))
# chislo2 = int(input('vvedite vtoroe chislo:'))
# if chislo1 > chislo2: 
#     print(chislo2)
# else:
#     print(chislo1) 

# ____________________________________________________________________________________________________________________
    
# 6) Даны три целых числа. Выведите значение наименьшего из них.
# chislo1 = int(input('vvedite pervoe chislo:'))
# chislo2 = int(input('vvedite vtoroe chislo:'))
# chislo3 = int(input('vvedite tretee chislo:'))
# if chislo1 > chislo2 and chislo3 > chislo2: 
#     print(chislo2)
# elif chislo2 > chislo1 and chislo3 > chislo1:
#     print(chislo1)
# elif chislo1 > chislo3 and chislo2 > chislo3: 
#     print(chislo3) 
# else:
#     print('ty oshibsya')

# ____________________________________________________________________________________________________________________

# 7) Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна вывести одно из чисел: 
# 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа различны).

# chislo1 = int(input('vvedite pervoe chislo:'))
# chislo2 = int(input('vvedite vtoroe chislo:'))
# chislo3 = int(input('vvedite tretee chislo:'))

# if chislo1 == chislo2 == chislo3: 
#     print(3)
# elif chislo1 == chislo2 or chislo2== chislo3 or chislo1==chislo3:
#     print(2)
# else:
#     print(0)

# ____________________________________________________________________________________________________________________

# 8) Вводятся два целых числа. Проверить делится ли первое на второе. 
# Вывести на экран сообщение об этом, частное (в любом случае), а также остаток от деления (если он есть). input: 678 23 
# output: 678 не делится на 23 
# Частное: 29 
# Остаток: 11

# chislo1 = int(input('vvedite pervoe chislo:'))
# chislo2 = int(input('vvedite vtoroe chislo:'))
 
# delenie = chislo1 % chislo2 
# print(delenie)

# ____________________________________________________________________________________________________________________

# 9) Дано номер года. Требуется определить, является ли год с данным номером високосным.
# Если год является високосным, то выведите YES, иначе выведите NO. Напомним, 
# что в соответствии с григорианским календарем, год является високосным, 
# если его номер кратен 4, но не кратен 100, а также если он кратен 400.

# data = int(input('vvedite datu:'))
# if data % 4 == 0 and data % 100 > 0 or data % 400 == 0:
#     print('yes')
# else:
#     print('no')

# ____________________________________________________________________________________________________________________


# 10)  Перевести число, введенное пользователем, в байты или килобайты в зависимости от его выбора.

# moshnost1 = input('esli hotite preobrazovat bytes na kilobytes napishite YES, elsi kilobytes na bytes napishite NO:')
# moshnost = int(input('vvedite moshnost:'))
# if moshnost == 'yes':
#     formula1 = moshnost // 1000 
#     print(formula1,'kilobytes')
# else:
#     print('hotite preobrazovat kilobytes na bytes?')
#     formula2 = moshnost * 1000 
#     print(formula2,'bytes')

# ____________________________________________________________________________________________________________________


# # 11) Создайте список при помощи встроенной функции.
# a = 'january','february','march','april','may','june','july','august','september','october','november','december'
# a = list(a)
# print(a)
# ____________________________________________________________________________________________________________________
    

# 12) Дан список list_ = [66.25, 333, 27.5, 86, 3.1432, 1546.89, 333, ]. Посчитайте сколько раз встречается (333), (3.1432) и ('n').
# ls = [66.25, 333, 27.5, 86, 3.1432, 1546.89, 333]
# i = ls.count(333)
# s = ls.count(3.1432)
# y = ls.count('n')
# print(i,s,y)

# ____________________________________________________________________________________________________________________
    

# 13) Дан список list_ = [66.25, 333, 27.5, 86, 3.1432, 1546.89, 333, ]. Узнайте под каким индексом лежит (86) и удалите (1546.89).
    
# ls = [66.25, 333, 27.5, 86, 3.1432, 1546.89, 333 ]
# i = ls.index(86)    
# s = ls.remove(1546.89)
# print('index of 86 is:',i,ls)

# ____________________________________________________________________________________________________________________

# 14) Дан список list_ = [66.25, 333, 27.5, 86, 3.1432, 1546.89, 333, ].
# Сперва отсортируйте его по возрастанию, а затем переверните его.

list_ = [66.25, 333, 27.5, 86, 3.1432, 1546.89, 333 ]
i = list.sort()
print(i)
y = list.sort(reverse=True)
print('after:', y)