# linux commands
# ctlr + alt + t - команда для открытия терминала только на ubuntu 
# ~ - символ домашней директории 
# / - символ корнейвой директории 
# . - обозначает текущую директорию 
# .. - обозначает предыдущую директорию
#  ls -  команда для ввода всех директорий(папка) и файлов в текущей(рабочей)
#  директории в терминале 
# cd (change directory) - команда для перехода из одной директории в другую
# mkdir - создает директории 
# touch - создает файлы 
# rm -rf -удаляет все файлы принудительно 
# rm - удаляет файлы 
# rmdir - удаляет пустую директорию 
# ls -a - показывает скрытые и обычные файлы и директории 
# ls -la - показывает подробную информацию
# 9. pwd(print working directory) - выводит путь до текущей директории 
# *. cp - копирует файл или директорю в указанное место 
#  cp <название> <куда>


# *. mv -  команда для перемещения файла в директории, 
# а также для переименования файла или директории
#       переименование: mv john.txt jamie.txt
#       перемещение: mv jonh.txt directory/



# cat - показывает содержание файла 
# nano - открывает файл для редактирования в графическом интерфейс Нано 
# *если нет файла, то нано создаст новый 

# echo - текст > файл

  