# GIT - распределенная система контроля версий 
# это система для отслеживания и ведения истории изменения файлов, в вашем проекте.
# При помощи распределенности в git еще и организовывается командная работа.

# Репозиторий - это хранилище вашего кода и истории его изменений 

# GitHub - веб сайти для размещения git-репозиториев в совместной разработке проектов

# команды Git: 
# 1.git init - она создает новый локальный репозиторий, в той директории в которой была прописана команда. (Команда вводится один раз в начале)

# 2.git add - команда для добавления изменений в систему отследивания гита 

# 3.git commit -m'<comment>' - команда для сохранения всех изменений в локальном репозитории с комментарием к ним 

# 4. git remote add <origin> <url> - это команда для того чтобы связать ваш локальный репо с удаленным репо в гитхабе 

# 5. git push <origin> <main> - команда отправки всех ваших изменений на удаленный репо 
